In [2]:
import pandas as pd
import sqlite3

In [3]:
con=sqlite3.connect("abc.db")
conc=con.cursor()

In [4]:
conc.execute('''CREATE TABLE IF NOT EXISTS std(id INTEGER PRIMARY KEY AUTOINCREMENT,name TEXT NOT NULL,grade TEXT)''')
conc.execute('''INSERT INTO std (name,grade) VALUES ("Ram","A+")''')
conc.execute('''INSERT INTO std (name,grade) VALUES  ("Shayam","A-")''')
conc.execute('''INSERT INTO std (name,grade) VALUES ("raju","A++")''')
conc.execute('''INSERT INTO std (name,grade) VALUES ("Ram","A+")''')


con.commit()

conc.execute("SELECT * FROM std")
abc=conc.fetchall()
print(abc)

[(1, 'Ram', 'A+'), (2, 'Shayam', 'A-'), (3, 'raju', 'A++'), (4, 'Ram', 'A+'), (5, 'Ram', 'A+'), (6, 'Shayam', 'A-'), (7, 'raju', 'A++'), (8, 'Ram', 'A+'), (9, 'Ram', 'A+'), (10, 'Shayam', 'A-'), (11, 'raju', 'A++'), (12, 'Ram', 'A+'), (13, 'Ram', 'A+'), (14, 'Shayam', 'A-'), (15, 'raju', 'A++'), (16, 'Ram', 'A+'), (17, 'Ram', 'A+'), (18, 'Shayam', 'A-'), (19, 'raju', 'A++'), (20, 'Ram', 'A+')]

In [7]:
pds=pd.read_sql_query("SELECT * FROM std",con)

In [24]:
print(pds)

    id    name grade
0    1     Ram    A+
1    2  Shayam    A-
2    3    raju   A++
3    4     Ram    A+
4    5     Ram    A+
5    6  Shayam    A-
6    7    raju   A++
7    8     Ram    A+
8    9     Ram    A+
9   10  Shayam    A-
10  11    raju   A++
11  12     Ram    A+
12  13     Ram    A+
13  14  Shayam    A-
14  15    raju   A++
15  16     Ram    A+

In [8]:
print(pds.head())

   id    name grade
0   1     Ram    A+
1   2  Shayam    A-
2   3    raju   A++
3   4     Ram    A+
4   5     Ram    A+

In [11]:
pds.tail()

    id    name grade
15  16     Ram    A+
16  17     Ram    A+
17  18  Shayam    A-
18  19    raju   A++
19  20     Ram    A+